src/Documents/РаспределениеЗаявки/РаспределениеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаспределениеЗаявки</name>
  <registerRecords>AccumulationRegister.РаспределениеЗаявок</registerRecords>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаФСВТС</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредметыСнабжения</name>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.НеиденитифицированныеПредметыСнабжения</types>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/РаспределениеЗаявки/ManagerModule.bsl
/////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция СформироватьТаблицуДвиженийРаспределениеЗаявок(Ссылка) Экспорт 
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	РаспределениеЗаявкиПредметыСнабжения.Ссылка.Дата КАК Период,
	             	  |	РаспределениеЗаявкиПредметыСнабжения.Ссылка.Заявка КАК Заявка,
	             	  |	РаспределениеЗаявкиПредметыСнабжения.ПредметСнабжения КАК ПредметСнабжения,
	             	  |	РаспределениеЗаявкиПредметыСнабжения.Ссылка.Исполнитель КАК Исполнитель,
	             	  |	РаспределениеЗаявкиПредметыСнабжения.Количество КАК Количество
	             	  |ИЗ
	             	  |	Документ.РаспределениеЗаявки.ПредметыСнабжения КАК РаспределениеЗаявкиПредметыСнабжения
	             	  |ГДЕ
	             	  |	РаспределениеЗаявкиПредметыСнабжения.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // СформироватьТаблицуДвиженийРаспределениеЗаявок
